app/controllers/departments_controller.rb

INSERT INTO "departments" ("department_name", "created_at", "updated_at") VALUES (?, ?, ?)  [["department_name", "Engineering"], ["created_at", "2019-05-20 15:59:14.868745"], ["updated_at", "2019-05-20 15:59:14.868745"]]
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_department
      @department = Department.find(params[:id])