app/controllers/employees_controller.rb

  def index
    # Eager-loading to solve N+1 query problem
    @employees = Employee.all.includes(:department)
---
SELECT "departments".* FROM "departments" WHERE "departments"."id" IN (?, ?)  [["id", 4], ["id", 5]]
SELECT "employees".* FROM "employees"